===
pipe a number
===

42 | it

---
(module
	(pipe
    (term (number))
    (variable)
	)
)

===
pipe two numbers to a lambda
===

12 33 | a + b

---
(module
	(pipe
    (term (number) (number))
    (binary (variable) (binary_operator) (variable))
	)
)

===
double pipe
===

12 33 | a + b | it + 1

---
(module
  (pipe
    (term
        (pipe
            (term (number) (number))
            (binary (variable) (binary_operator) (variable)))
    )
    (binary (variable) (binary_operator) (number))
  )
)

===
pipe and equals
===

a = 4 | it + 1

---
(module
  (assignment
    (variable)
    value: (pipe
      (term (number))
      (binary
        left: (variable)
        (binary_operator)
        right: (number))
    )
  )
)
