=======
specify beginning and ending
=======

1..10

---

(module
  (range
    begin: (number)
    operator: (inclusive)
    end: (number)))

=======
specify ending only
=======

..10

---

(module
  (range
    operator: (inclusive)
    end: (number)))

=======
specify begining only
=======

5..

---

(module
  (range
    begin: (number)
    operator: (inclusive)
    ))

=======
specify exclusive range
=======

5..<10

---

(module
  (range
    begin: (number)
    operator: (exclusive)
    end: (number)))
